{
  "backend/main.mo": "Main Motoko actor implementing the backend for Heavenuse, including user profiles, family group management, memory posts, and group chat with access control and authorization mixins.",
  "backend/migration.mo": "Defines Old and New actor state types and a migration function that upgrades state by adding an empty messages map to support the new group chat feature.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (app rename, group chat, media gallery, display names) to their source files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, serving as a reference index for the frontend codebase.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining OKLCH-based design tokens for light and dark themes including background, primary, and chart colors.",
  "frontend/index.html": "Minimal HTML entry point with the page title set to 'Heavenuse' and a root div for the React app.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for feed, groups, and group chat pages, and handles authentication state and profile setup modal.",
  "frontend/src/components/CreateMemoryModal.tsx": "Dialog form component for creating a new memory post with title, description, and image URL fields, including validation and submission via the createMemoryPost mutation.",
  "frontend/src/components/GroupSelector.tsx": "A dropdown component that fetches all family groups and lets the user select one, displaying a loading skeleton while data is loading.",
  "frontend/src/components/LandingPage.tsx": "The public landing page for Heavenuse, showcasing a hero banner, feature cards (chat, media sharing, private groups), and sign-in buttons.",
  "frontend/src/components/Layout.tsx": "The main authenticated app shell with a sticky header, desktop and mobile navigation (Memories, Groups, Chat), and an outlet for child routes.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity login and logout, showing a spinner during the login process and clearing the React Query cache on logout.",
  "frontend/src/components/MediaGallery.tsx": "Displays a grid gallery of all image and video messages from a group chat, with loading skeletons and an empty state when no media exists.",
  "frontend/src/components/MemoryCard.tsx": "A scrapbook-styled card component that renders a single memory post with its image, title, description, author name, and formatted timestamp.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts newly authenticated users to enter a display name before using the app, saving it via the profile mutation hook.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous backend actor using the user's Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, wrapping DFINITY's AuthClient to expose login, logout, and identity state with status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profiles, family groups, memory posts, and chat messages using the actor from useActor.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and defining Tailwind CSS base styles with a warm cream/terracotta design token system for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/FamilyGroupPage.tsx": "Page for managing family groups, allowing users to create groups, add/remove members, view group details, and access media galleries and chat.",
  "frontend/src/pages/FeedPage.tsx": "Memory feed page that displays posts for a selected family group with group switching, skeleton loading states, and a modal for creating new memories.",
  "frontend/src/pages/GroupChatPage.tsx": "Real-time group chat page that renders message bubbles with text and media support, and allows sending and deleting messages within a specific family group.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist, retrieve, and clear those parameters via sessionStorage and history.replaceState.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom fonts (serif, handwritten, body), an extended color palette using oklch CSS variables, custom shadows, border radii, and animation keyframes for a warm scrapbook-inspired theme.",
  "project_state.json": "Project state manifest for 'Heavenuse', a family communication app, tracking schema version, existing implemented features (auth, memory feed, group chat, theming, etc.), architectural notes, and known issues."
}